# HW2
In this assignment, you will learn how to preprocess data using SQLite and Pandas.<br>
When submitting, rename the file to HW02_[student_id].ipynb (ex.HW02_20211234.ipynb) and submit it to PLMS.

In [12]:
import sqlite3
import pandas as pd

## 1. SQLite and Python

### a. Create a SQLite Database
Here, you will learn how to connect a SQLite database and insert a data into it.<br>
1. Create and connect a database named `temp.db`.<br>
2. Create a table named `Airbnb` where the column names are 'City, Price, Hostname, Latitude, Longitude' respectively.<br>
    (You don't need to specify a data type.)<br>
3. Insert the data below **at once** and save the changes. <br>

    | City      | Price | Hostname | Latitude | Longitude |
    | :- | :- | :- | :- | :- |
    | New York  | 100   | Jennifer | 40.75    | -73.983   |
    | New York  | 175   | Andy     | 40.66536 | -74.264   |
    | Hawaii    | 200   | Edward   | 19.453   | -155.3579 |
    | San Diego | 68    | Isabel   | 32.473   | -117.1263 |
    | San Diego | 96    | Alice    | 32.5852  | -117.2361 |


4. Create a table named `Crime` and insert the data below **at once** and save the changes. <br>

    | Location      | Year | Num_crime |
    | :- | :- | :- |
    | New York  | 2021   | 1957 | 
    | New York  | 2022   | 2395     | 
    | San Diego    | 2021   | 749   | 
    | San Diego | 2022    | 627   | 

5. Create a table named `Job` and insert the data below **one by one** and save the changes. <br>

    | Employee      | Company | Gender |
    | :- | :- | :- |
    | Andy  | Amazon   | M | 
    | Isabel  | Netflix   | F     |

In [13]:
# 1번
con = sqlite3.connect("temp.db")
cur = con.cursor()

# 2번
cur.execute('create table Airbnb(City text, Price integer, Hostname text, Latitude real, Longitude real)')

# 3번
cur.executemany(
    'insert into Airbnb values (?, ?, ?, ?, ?)',
    [
        ('New York', 100, 'Jennifer', 40.75, -73.983),
        ('New York', 175, 'Andy', 40.66536, -74.264),
        ('Hawaii', 200, 'Edward', 19.453, -155.3579),
        ('San Diego', 68, 'Isabel', 32.473, -117.1263),
        ('San Diego', 96, 'Alice', 32.5852, -117.2361),
    ]
)
con.commit()

# 4번
cur.execute(
    'create table Crime(Location text, Year integer, Num_crime integer)')
cur.executemany(
    'insert into Crime values (?, ?, ?)',
    [
        ('New York', 2021, 1957),
        ('New York', 2022, 2395),
        ('San Diego', 2021, 749),
        ('San Diego', 2022, 627),
    ]
)
con.commit()

# 5번
cur.execute(
    'create table Job(Employee text, Company text, Gender text)')
cur.execute(
    """insert into Job values ('Andy', 'Amazon', 'M')""")
cur.execute(
    """insert into Job values ('Isabel', 'Netflix', 'F')""")
con.commit()

con.close()

6. Connect database named `temp.db` and print all data in `Airbnb`.
    (Printed results should be a list of tuples.)

In [4]:
con = sqlite3.connect("temp.db")
cur = con.cursor()

cur.execute('select * from Airbnb')

rows = cur.fetchall()

print(rows)

con.close()

[('New York', 100, 'Jennifer', 40.75, -73.983), ('New York', 175, 'Andy', 40.66536, -74.264), ('Hawaii', 200, 'Edward', 19.453, -155.3579), ('San Diego', 68, 'Isabel', 32.473, -117.1263), ('San Diego', 96, 'Alice', 32.5852, -117.2361)]

### b. Execute Queries
Here, you will execute multiple queries using the database `temp.db`.<br>
1. Connect the database `temp.db` and print Airbnb in New York that costs less than 120.<br>
(Printed results should be either a list of tuples or a tuple.)

In [15]:
con = sqlite3.connect("temp.db")
cur = con.cursor()

df_airbnb = pd.read_sql_query(
    """select * from Airbnb""",
    con
)
df_crime = pd.read_sql_query(
    """select * from Crime""",
    con
)
df_job = pd.read_sql_query(
    """select * from Job""",
    con
)

In [14]:
con = sqlite3.connect("temp.db")
cur = con.cursor()

cur.execute("""select * from Airbnb where City = 'New York' and Price < 120""")

rows = cur.fetchall()

print(rows)

con.close()

[('New York', 100, 'Jennifer', 40.75, -73.983)]

2. Connect the database `temp.db` and output the average crime rate by city in descending order.

In [6]:
con = sqlite3.connect("temp.db")
cur = con.cursor()

cur.execute("""
    select Location, avg(Num_crime) as Num_crime_avg from Crime group by Location order by Num_crime_avg desc
""")

rows = cur.fetchall()

print(rows)

con.close()

[('New York', 2176.0), ('San Diego', 688.0)]

3. Connect the database `temp.db`.<br>
    Select City, Price, Hostname from `Airbnb` and select all columns from `Job`.<br>
    Left join `Airbnb` and `Job` using 'Hostname' and 'Employee' columns respectively.

In [7]:
con = sqlite3.connect("temp.db")
cur = con.cursor()

cur.execute("""
    select City, Price, Hostname, Employee, Company, Gender from Airbnb left join Job on Airbnb.Hostname = Job.Employee
""")

rows = cur.fetchall()

print(rows)

con.close()

[('New York', 100, 'Jennifer', None, None, None), ('New York', 175, 'Andy', 'Andy', 'Amazon', 'M'), ('Hawaii', 200, 'Edward', None, None, None), ('San Diego', 68, 'Isabel', 'Isabel', 'Netflix', 'F'), ('San Diego', 96, 'Alice', None, None, None)]

## 2. SQLite and Pandas
Here, you will convert SQLite data to Pandas dataframe and process it.<br>
Students must use Pandas library to solve problems.<br>
Reference: https://pythonspot.com/sqlite-database-with-pandas/

1. Connect the database `temp.db` and print Airbnb in New York that costs less than 120.

In [16]:
con = sqlite3.connect("temp.db")

df = pd.read_sql_query(
    """select * from Airbnb where City = 'New York' and Price < 120""",
    con)

print(df)

con.close()

       City  Price  Hostname  Latitude  Longitude
0  New York    100  Jennifer     40.75    -73.983

2. Connect the database `temp.db` and output the dataframe that records the average number of crimes by city in descending order. (columns should be 'Location', 'Num_crime_avg')

In [17]:
con = sqlite3.connect("temp.db")

df2 = pd.read_sql_query("""
    select Location, avg(Num_crime) as Num_crime_avg from Crime group by Location order by Num_crime_avg desc
""", con)

print(df2)

con.close()

    Location  Num_crime_avg
0   New York         2176.0
1  San Diego          688.0

3. Connect the database `temp.db`.<br>
    Select City, Price, Hostname from `Airbnb` and select all columns from `Job`.<br>
    Left join `Airbnb` and `Job` using 'Name' and 'Employee' columns respectively.<br>
    Write and save the output dataframe to sql table named `Address`.

In [18]:
con = sqlite3.connect("temp.db")

df3 = pd.read_sql_query("""
    select City, Price, Hostname, Employee, Company, Gender from Airbnb left join Job on Airbnb.Hostname = Job.Employee
""", con)

print(df3)

# table 이름, connection, index
df3.to_sql('Address', con, index=False)

con.close()

        City  Price  Hostname Employee  Company Gender
0   New York    100  Jennifer     None     None   None
1   New York    175      Andy     Andy   Amazon      M
2     Hawaii    200    Edward     None     None   None
3  San Diego     68    Isabel   Isabel  Netflix      F
4  San Diego     96     Alice     None     None   None

4. Connect the database `temp.db` and print all rows and columns in the `Address` table.

In [19]:
con = sqlite3.connect("temp.db")
cur = con.cursor()

cur.execute('select * from Address')

rows = cur.fetchall()

print(rows)

con.close()

[('New York', 100, 'Jennifer', None, None, None), ('New York', 175, 'Andy', 'Andy', 'Amazon', 'M'), ('Hawaii', 200, 'Edward', None, None, None), ('San Diego', 68, 'Isabel', 'Isabel', 'Netflix', 'F'), ('San Diego', 96, 'Alice', None, None, None)]

## 3. SQL Query
Here, students must use **sqlite shell** to solve problems.<br>
Do not write python scripts that use sqlite3 library.<br>
You may encounter errors when running cells on jupyter notebook, but it is okay as long as it works fine on the sqlite shell.

| 1  | data   | 4 | 
| :- | :- | :- |
| 1  | base   | 3 | 
| 1  | system   | 5 | 
| 1  | fall   | 6 | 
| 1  | semester   | 2 | 
| 2  | data   | 1 | 
| 2  | base   | 2 | 
| 2  | structure   | 3 | 
| 2  | network   | 4 | 
| 2  | algorithm   | 5 | 
| 3  | ds   | 2 | 
| 3  | sd   | 3 | 
| 3  | final   | 4 | 
| 3  | mid   | 5 | 
| 4  | system   | 1 | 
| 4  | ds   | 4 | 
| 4  | sd   | 3 | 
| 4  | pl   | 5 | 
| 4  | data   | 2 | 
| 5  | base   | 2 | 
| 5  | structure   | 2 | 
| 5  | network   | 3 | 
| 5  | fall   | 4 | 
| 6  | data   | 2 | 
| 6  | base   | 4 |

### a. Import CSV
Make a csv file from the data above and import it to SQLite database.<br>
Execute the query below in the sqlite shell.
- Create table Documents(DocID int, Term text, Count int);
- .mode csv
- .import [csvpath]/Document.csv Documents

In [ ]:
create table Documents(DocID int, Term text, Count int);
.mode csv
.import ./Document.csv Documents

### b. Relational Algebra Expression
Write an SQL Query that is equivalemt to the following relational algebra expression.<br>

1. $\pi_{Term}(σ_{DocID=2(Documents)}) \cup π_{Term}(σ_{count=3(Documents)})$
2. Try both union and union all to see the difference
3. Try “or” instead of “union” and compare results with using union

In [20]:
con = sqlite3.connect("temp.db")

df_documents = pd.read_sql_query(
    """select * from Documents"""
    ,con
)

In [ ]:
# 1
select Term from Documents where DocID = 2 union select Term from Documents where Count = 3;
# 2
# union시 set 연산으로 중복 제거 / union all 시 bag 연산으로 중복 포함
select Term from Documents where DocID = 2 union select Term from Documents where Count = 3;
select Term from Documents where DocID = 2 union all select Term from Documents where Count = 3;
# 3
# DocID = 2이면서 Count = 3인 경우 중복되지 않고 하나의 record로 출력
select Term from Documents where DocID = 2 or Count = 3;

### c. SQLite Query Exercise-1

1. Write an SQL query that counts the number of documents that contain either the word “system” or “data”.

In [ ]:
select count(DocID) from
    (select DocID from Documents where Term="system" or Term="data" group by DocID);

2. Write an SQL query that returns total count of each Terms in all DocID. Do not include DocID in the final result.

In [ ]:
select Term, sum(Count) from Documents group by Term;

3. Write an SQL query that finds all documents that have more than 4 distinct terms.

In [ ]:
select count(DocID) from
    (select DocID from Documents group by DocID having count(distinct Term) > 4);

### d. SQLite Query Exercise-2
Write an SQL query to compute the similarity of every pair of documents in Documents. <br>
The similarity here is computed by summing the same term counts of two documents.<br>
For example, the similarity of Doc1 <’a’:2, ‘b’:1, ‘c’:3> and Doc2 <’b’:2, ‘c’:1, ‘d’:4> is 1\*2 (‘b’) + 3\*1 (‘c’) = 5.<br>
(Hint: to avoid computing the similarity of both (Doc1, Doc2) and (Doc2, Doc1), add a condition of the form a.DocID < b.DocID.)

In [ ]:
select a.DocID, b.DocID, 
    sum(case when a.Term = b.Term then a.Count * b.Count else 0 end) from 
    Documents a, Documents b on a.DocID < b.DocID group by a.DocID, b.DocID;

## Reference:

https://docs.python.org/3/library/sqlite3.html?highlight=sqlite#module-sqlite3